---
kind: other
id: Properties.T:Autodesk.Revit.DB.SelectionFilterElement
source: html/aeb74680-067b-b6de-eb91-f397557eaab5.htm
---
# SelectionFilterElement Properties

The id of the assembly instance to which the element belongs.